/*文件名：1527403034_E12.c
*作者：王俊
*时间：2015年10月23日
*功能：从键盘输入两个浮点数x1和y1作为圆心坐标，从键盘输入一个浮点数r作为半径，这样就在二维平面上唯一地确定了个圆。再从键盘输入两个浮点数x2和y2，求坐标(x2,y2)是在圆上还是圆外？（圆周上也是在圆上）
*备注：
*/
#include<stdio.h>
int main()
{
	double x1=0,y1=0,r=0;
	double x2=0,y2=0;
	//输入圆心坐标与半径
	printf("请依次输入圆心坐标与半径:\n");
	scanf("%lf%lf%lf",&x1,&y1,&r);
	printf("请输入一个点(x2,y2):\n");
	scanf("%lf%lf",&x2,&y2);
	x1=(x2-x1)*(x2-x1)+(y2-y1)*(y2-y1);
	//判断是在圆上还是圆外
	if(x1<=r*r)
	{
		//输出
		printf("(x2,y2)在圆上\n");
	}
	else
	{
		//输出
		printf("(x2,y2)在圆外\n");
	}


	return 0;
}